JohannesWilde/DeviceTester/avrSrc/iom328p_converted.h
#define PCMSK1_REGISTER 0x6C
#define PCMSK1_TYPE uint8_t
#define PCMSK1_ACCESS _SFR_MEM8
#define PCMSK1 PCMSK1_ACCESS(PCMSK1_REGISTER)
#define PCINT8 0
#define PCINT9 1
#define PCINT10 2
#define PCINT11 3
#define PCINT12 4
#define PCINT13 5
#define PCINT14 6

#define PCMSK2_REGISTER 0x6D
#define PCMSK2_TYPE uint8_t
#define PCMSK2_ACCESS _SFR_MEM8
#define PCMSK2 PCMSK2_ACCESS(PCMSK2_REGISTER)
#define PCINT16 0
#define PCINT17 1
#define PCINT18 2
#define PCINT19 3
#define PCINT20 4
#define PCINT21 5
#define PCINT22 6
#define PCINT23 7

#define TIMSK0_REGISTER 0x6E
#define TIMSK0_TYPE uint8_t
#define TIMSK0_ACCESS _SFR_MEM8
#define TIMSK0 TIMSK0_ACCESS(TIMSK0_REGISTER)
#define TOIE0 0
#define OCIE0A 1
#define OCIE0B 2

#define TIMSK1_REGISTER 0x6F
#define TIMSK1_TYPE uint8_t
#define TIMSK1_ACCESS _SFR_MEM8
#define TIMSK1 TIMSK1_ACCESS(TIMSK1_REGISTER)
#define TOIE1 0
#define OCIE1A 1
#define OCIE1B 2
#define ICIE1 5

#define TIMSK2_REGISTER 0x70
#define TIMSK2_TYPE uint8_t
#define TIMSK2_ACCESS _SFR_MEM8
#define TIMSK2 TIMSK2_ACCESS(TIMSK2_REGISTER)
#define TOIE2 0
#define OCIE2A 1
#define OCIE2B 2

#ifndef __ASSEMBLER__
#define ADC_REGISTER 0x78
#define ADC_TYPE uint16_t
#define ADC_ACCESS _SFR_MEM16
#define ADC ADC_ACCESS(ADC_REGISTER)
#endif
#define ADCW_REGISTER 0x78
#define ADCW_TYPE uint16_t
#define ADCW_ACCESS _SFR_MEM16
#define ADCW ADCW_ACCESS(ADCW_REGISTER)

#define ADCL_REGISTER 0x78
#define ADCL_TYPE uint8_t
#define ADCL_ACCESS _SFR_MEM8
#define ADCL ADCL_ACCESS(ADCL_REGISTER)
#define ADCL0 0
#define ADCL1 1
#define ADCL2 2
#define ADCL3 3
#define ADCL4 4
#define ADCL5 5
#define ADCL6 6
#define ADCL7 7

#define ADCH_REGISTER 0x79
#define ADCH_TYPE uint8_t
#define ADCH_ACCESS _SFR_MEM8
#define ADCH ADCH_ACCESS(ADCH_REGISTER)
#define ADCH0 0
#define ADCH1 1
#define ADCH2 2
#define ADCH3 3
#define ADCH4 4
#define ADCH5 5
#define ADCH6 6
#define ADCH7 7

#define ADCSRA_REGISTER 0x7A
#define ADCSRA_TYPE uint8_t
#define ADCSRA_ACCESS _SFR_MEM8
#define ADCSRA ADCSRA_ACCESS(ADCSRA_REGISTER)
#define ADPS0 0
#define ADPS1 1
#define ADPS2 2
#define ADIE 3
#define ADIF 4
#define ADATE 5
#define ADSC 6
#define ADEN 7

#define ADCSRB_REGISTER 0x7B
#define ADCSRB_TYPE uint8_t
#define ADCSRB_ACCESS _SFR_MEM8
#define ADCSRB ADCSRB_ACCESS(ADCSRB_REGISTER)
#define ADTS0 0
#define ADTS1 1
#define ADTS2 2
#define ACME 6

#define ADMUX_REGISTER 0x7C
#define ADMUX_TYPE uint8_t
#define ADMUX_ACCESS _SFR_MEM8
#define ADMUX ADMUX_ACCESS(ADMUX_REGISTER)
#define MUX0 0
#define MUX1 1
#define MUX2 2
#define MUX3 3
#define ADLAR 5
#define REFS0 6
#define REFS1 7

#define DIDR0_REGISTER 0x7E
#define DIDR0_TYPE uint8_t
#define DIDR0_ACCESS _SFR_MEM8
#define DIDR0 DIDR0_ACCESS(DIDR0_REGISTER)
#define ADC0D 0
#define ADC1D 1
#define ADC2D 2
#define ADC3D 3
#define ADC4D 4
#define ADC5D 5

#define DIDR1_REGISTER 0x7F
#define DIDR1_TYPE uint8_t
#define DIDR1_ACCESS _SFR_MEM8
#define DIDR1 DIDR1_ACCESS(DIDR1_REGISTER)
#define AIN0D 0
#define AIN1D 1

#define TCCR1A_REGISTER 0x80
#define TCCR1A_TYPE uint8_t
#define TCCR1A_ACCESS _SFR_MEM8
#define TCCR1A TCCR1A_ACCESS(TCCR1A_REGISTER)
#define WGM10 0
#define WGM11 1
#define COM1B0 4
#define COM1B1 5
#define COM1A0 6
#define COM1A1 7

#define TCCR1B_REGISTER 0x81
#define TCCR1B_TYPE uint8_t
#define TCCR1B_ACCESS _SFR_MEM8
#define TCCR1B TCCR1B_ACCESS(TCCR1B_REGISTER)
#define CS10 0
#define CS11 1
#define CS12 2
#define WGM12 3
#define WGM13 4
#define ICES1 6
#define ICNC1 7

#define TCCR1C_REGISTER 0x82
#define TCCR1C_TYPE uint8_t
#define TCCR1C_ACCESS _SFR_MEM8
#define TCCR1C TCCR1C_ACCESS(TCCR1C_REGISTER)
#define FOC1B 6
#define FOC1A 7

#define TCNT1_REGISTER 0x84
#define TCNT1_TYPE uint16_t
#define TCNT1_ACCESS _SFR_MEM16
#define TCNT1 TCNT1_ACCESS(TCNT1_REGISTER)

#define TCNT1L_REGISTER 0x84
#define TCNT1L_TYPE uint8_t
#define TCNT1L_ACCESS _SFR_MEM8
#define TCNT1L TCNT1L_ACCESS(TCNT1L_REGISTER)
#define TCNT1L0 0
#define TCNT1L1 1
#define TCNT1L2 2
#define TCNT1L3 3
#define TCNT1L4 4
#define TCNT1L5 5
#define TCNT1L6 6
#define TCNT1L7 7

#define TCNT1H_REGISTER 0x85
#define TCNT1H_TYPE uint8_t
#define TCNT1H_ACCESS _SFR_MEM8
#define TCNT1H TCNT1H_ACCESS(TCNT1H_REGISTER)
#define TCNT1H0 0
#define TCNT1H1 1
#define TCNT1H2 2
#define TCNT1H3 3
#define TCNT1H4 4
#define TCNT1H5 5
#define TCNT1H6 6
#define TCNT1H7 7

#define ICR1_REGISTER 0x86
#define ICR1_TYPE uint16_t
#define ICR1_ACCESS _SFR_MEM16
#define ICR1 ICR1_ACCESS(ICR1_REGISTER)

#define ICR1L_REGISTER 0x86
#define ICR1L_TYPE uint8_t
#define ICR1L_ACCESS _SFR_MEM8
#define ICR1L ICR1L_ACCESS(ICR1L_REGISTER)
#define ICR1L0 0
#define ICR1L1 1
#define ICR1L2 2
#define ICR1L3 3
#define ICR1L4 4
#define ICR1L5 5
#define ICR1L6 6
#define ICR1L7 7

#define ICR1H_REGISTER 0x87
#define ICR1H_TYPE uint8_t
#define ICR1H_ACCESS _SFR_MEM8
#define ICR1H ICR1H_ACCESS(ICR1H_REGISTER)
#define ICR1H0 0
#define ICR1H1 1
#define ICR1H2 2
#define ICR1H3 3
#define ICR1H4 4
#define ICR1H5 5
#define ICR1H6 6
#define ICR1H7 7

#define OCR1A_REGISTER 0x88
#define OCR1A_TYPE uint16_t
#define OCR1A_ACCESS _SFR_MEM16
#define OCR1A OCR1A_ACCESS(OCR1A_REGISTER)

#define OCR1AL_REGISTER 0x88
#define OCR1AL_TYPE uint8_t
#define OCR1AL_ACCESS _SFR_MEM8
#define OCR1AL OCR1AL_ACCESS(OCR1AL_REGISTER)
#define OCR1AL0 0
#define OCR1AL1 1
#define OCR1AL2 2
#define OCR1AL3 3
#define OCR1AL4 4
#define OCR1AL5 5
#define OCR1AL6 6
#define OCR1AL7 7

#define OCR1AH_REGISTER 0x89
#define OCR1AH_TYPE uint8_t
#define OCR1AH_ACCESS _SFR_MEM8
#define OCR1AH OCR1AH_ACCESS(OCR1AH_REGISTER)
#define OCR1AH0 0
#define OCR1AH1 1
#define OCR1AH2 2
#define OCR1AH3 3
#define OCR1AH4 4
#define OCR1AH5 5
#define OCR1AH6 6
#define OCR1AH7 7

#define OCR1B_REGISTER 0x8A
#define OCR1B_TYPE uint16_t
#define OCR1B_ACCESS _SFR_MEM16
#define OCR1B OCR1B_ACCESS(OCR1B_REGISTER)

#define OCR1BL_REGISTER 0x8A
#define OCR1BL_TYPE uint8_t
#define OCR1BL_ACCESS _SFR_MEM8
#define OCR1BL OCR1BL_ACCESS(OCR1BL_REGISTER)
#define OCR1BL0 0
#define OCR1BL1 1
#define OCR1BL2 2
#define OCR1BL3 3
#define OCR1BL4 4
#define OCR1BL5 5
#define OCR1BL6 6
#define OCR1BL7 7

