JohannesWilde/DeviceTester/avrSrc/iom328p_converted.h
#define OCR1BH_REGISTER 0x8B
#define OCR1BH_TYPE uint8_t
#define OCR1BH_ACCESS _SFR_MEM8
#define OCR1BH OCR1BH_ACCESS(OCR1BH_REGISTER)
#define OCR1BH0 0
#define OCR1BH1 1
#define OCR1BH2 2
#define OCR1BH3 3
#define OCR1BH4 4
#define OCR1BH5 5
#define OCR1BH6 6
#define OCR1BH7 7

#define TCCR2A_REGISTER 0xB0
#define TCCR2A_TYPE uint8_t
#define TCCR2A_ACCESS _SFR_MEM8
#define TCCR2A TCCR2A_ACCESS(TCCR2A_REGISTER)
#define WGM20 0
#define WGM21 1
#define COM2B0 4
#define COM2B1 5
#define COM2A0 6
#define COM2A1 7

#define TCCR2B_REGISTER 0xB1
#define TCCR2B_TYPE uint8_t
#define TCCR2B_ACCESS _SFR_MEM8
#define TCCR2B TCCR2B_ACCESS(TCCR2B_REGISTER)
#define CS20 0
#define CS21 1
#define CS22 2
#define WGM22 3
#define FOC2B 6
#define FOC2A 7

#define TCNT2_REGISTER 0xB2
#define TCNT2_TYPE uint8_t
#define TCNT2_ACCESS _SFR_MEM8
#define TCNT2 TCNT2_ACCESS(TCNT2_REGISTER)
#define TCNT2_0 0
#define TCNT2_1 1
#define TCNT2_2 2
#define TCNT2_3 3
#define TCNT2_4 4
#define TCNT2_5 5
#define TCNT2_6 6
#define TCNT2_7 7

#define OCR2A_REGISTER 0xB3
#define OCR2A_TYPE uint8_t
#define OCR2A_ACCESS _SFR_MEM8
#define OCR2A OCR2A_ACCESS(OCR2A_REGISTER)
#define OCR2_0 0
#define OCR2_1 1
#define OCR2_2 2
#define OCR2_3 3
#define OCR2_4 4
#define OCR2_5 5
#define OCR2_6 6
#define OCR2_7 7

#define OCR2B_REGISTER 0xB4
#define OCR2B_TYPE uint8_t
#define OCR2B_ACCESS _SFR_MEM8
#define OCR2B OCR2B_ACCESS(OCR2B_REGISTER)
#define OCR2_0 0
#define OCR2_1 1
#define OCR2_2 2
#define OCR2_3 3
#define OCR2_4 4
#define OCR2_5 5
#define OCR2_6 6
#define OCR2_7 7

#define ASSR_REGISTER 0xB6
#define ASSR_TYPE uint8_t
#define ASSR_ACCESS _SFR_MEM8
#define ASSR ASSR_ACCESS(ASSR_REGISTER)
#define TCR2BUB 0
#define TCR2AUB 1
#define OCR2BUB 2
#define OCR2AUB 3
#define TCN2UB 4
#define AS2 5
#define EXCLK 6

#define TWBR_REGISTER 0xB8
#define TWBR_TYPE uint8_t
#define TWBR_ACCESS _SFR_MEM8
#define TWBR TWBR_ACCESS(TWBR_REGISTER)
#define TWBR0 0
#define TWBR1 1
#define TWBR2 2
#define TWBR3 3
#define TWBR4 4
#define TWBR5 5
#define TWBR6 6
#define TWBR7 7

#define TWSR_REGISTER 0xB9
#define TWSR_TYPE uint8_t
#define TWSR_ACCESS _SFR_MEM8
#define TWSR TWSR_ACCESS(TWSR_REGISTER)
#define TWPS0 0
#define TWPS1 1
#define TWS3 3
#define TWS4 4
#define TWS5 5
#define TWS6 6
#define TWS7 7

#define TWAR_REGISTER 0xBA
#define TWAR_TYPE uint8_t
#define TWAR_ACCESS _SFR_MEM8
#define TWAR TWAR_ACCESS(TWAR_REGISTER)
#define TWGCE 0
#define TWA0 1
#define TWA1 2
#define TWA2 3
#define TWA3 4
#define TWA4 5
#define TWA5 6
#define TWA6 7

#define TWDR_REGISTER 0xBB
#define TWDR_TYPE uint8_t
#define TWDR_ACCESS _SFR_MEM8
#define TWDR TWDR_ACCESS(TWDR_REGISTER)
#define TWD0 0
#define TWD1 1
#define TWD2 2
#define TWD3 3
#define TWD4 4
#define TWD5 5
#define TWD6 6
#define TWD7 7

#define TWCR_REGISTER 0xBC
#define TWCR_TYPE uint8_t
#define TWCR_ACCESS _SFR_MEM8
#define TWCR TWCR_ACCESS(TWCR_REGISTER)
#define TWIE 0
#define TWEN 2
#define TWWC 3
#define TWSTO 4
#define TWSTA 5
#define TWEA 6
#define TWINT 7

#define TWAMR_REGISTER 0xBD
#define TWAMR_TYPE uint8_t
#define TWAMR_ACCESS _SFR_MEM8
#define TWAMR TWAMR_ACCESS(TWAMR_REGISTER)
#define TWAM0 0
#define TWAM1 1
#define TWAM2 2
#define TWAM3 3
#define TWAM4 4
#define TWAM5 5
#define TWAM6 6

#define UCSR0A_REGISTER 0xC0
#define UCSR0A_TYPE uint8_t
#define UCSR0A_ACCESS _SFR_MEM8
#define UCSR0A UCSR0A_ACCESS(UCSR0A_REGISTER)
#define MPCM0 0
#define U2X0 1
#define UPE0 2
#define DOR0 3
#define FE0 4
#define UDRE0 5
#define TXC0 6
#define RXC0 7

#define UCSR0B_REGISTER 0xC1
#define UCSR0B_TYPE uint8_t
#define UCSR0B_ACCESS _SFR_MEM8
#define UCSR0B UCSR0B_ACCESS(UCSR0B_REGISTER)
#define TXB80 0
#define RXB80 1
#define UCSZ02 2
#define TXEN0 3
#define RXEN0 4
#define UDRIE0 5
#define TXCIE0 6
#define RXCIE0 7

#define UCSR0C_REGISTER 0xC2
#define UCSR0C_TYPE uint8_t
#define UCSR0C_ACCESS _SFR_MEM8
#define UCSR0C UCSR0C_ACCESS(UCSR0C_REGISTER)
#define UCPOL0 0
#define UCSZ00 1
#define UCPHA0 1
#define UCSZ01 2
#define UDORD0 2
#define USBS0 3
#define UPM00 4
#define UPM01 5
#define UMSEL00 6
#define UMSEL01 7

#define UBRR0_REGISTER 0xC4
#define UBRR0_TYPE uint16_t
#define UBRR0_ACCESS _SFR_MEM16
#define UBRR0 UBRR0_ACCESS(UBRR0_REGISTER)

#define UBRR0L_REGISTER 0xC4
#define UBRR0L_TYPE uint8_t
#define UBRR0L_ACCESS _SFR_MEM8
#define UBRR0L UBRR0L_ACCESS(UBRR0L_REGISTER)
#define UBRR0_0 0
#define UBRR0_1 1
#define UBRR0_2 2
#define UBRR0_3 3
#define UBRR0_4 4
#define UBRR0_5 5
#define UBRR0_6 6
#define UBRR0_7 7

#define UBRR0H_REGISTER 0xC5
#define UBRR0H_TYPE uint8_t
#define UBRR0H_ACCESS _SFR_MEM8
#define UBRR0H UBRR0H_ACCESS(UBRR0H_REGISTER)
#define UBRR0_8 0
#define UBRR0_9 1
#define UBRR0_10 2
#define UBRR0_11 3

#define UDR0_REGISTER 0xC6
#define UDR0_TYPE uint8_t
#define UDR0_ACCESS _SFR_MEM8
#define UDR0 UDR0_ACCESS(UDR0_REGISTER)
#define UDR0_0 0
#define UDR0_1 1
#define UDR0_2 2
#define UDR0_3 3
#define UDR0_4 4
#define UDR0_5 5
#define UDR0_6 6
#define UDR0_7 7



/* Interrupt Vectors */
/* Interrupt Vector 0 is the reset vector. */

#define INT0_vect_num     1
#define INT0_vect         _VECTOR(1)   /* External Interrupt Request 0 */

#define INT1_vect_num     2
#define INT1_vect         _VECTOR(2)   /* External Interrupt Request 1 */

#define PCINT0_vect_num   3
#define PCINT0_vect       _VECTOR(3)   /* Pin Change Interrupt Request 0 */

#define PCINT1_vect_num   4
#define PCINT1_vect       _VECTOR(4)   /* Pin Change Interrupt Request 0 */

#define PCINT2_vect_num   5
#define PCINT2_vect       _VECTOR(5)   /* Pin Change Interrupt Request 1 */

#define WDT_vect_num      6
#define WDT_vect          _VECTOR(6)   /* Watchdog Time-out Interrupt */

#define TIMER2_COMPA_vect_num 7
#define TIMER2_COMPA_vect _VECTOR(7)   /* Timer/Counter2 Compare Match A */

#define TIMER2_COMPB_vect_num 8
#define TIMER2_COMPB_vect _VECTOR(8)   /* Timer/Counter2 Compare Match A */

#define TIMER2_OVF_vect_num   9
#define TIMER2_OVF_vect   _VECTOR(9)   /* Timer/Counter2 Overflow */

#define TIMER1_CAPT_vect_num  10
#define TIMER1_CAPT_vect  _VECTOR(10)  /* Timer/Counter1 Capture Event */

#define TIMER1_COMPA_vect_num 11
#define TIMER1_COMPA_vect _VECTOR(11)  /* Timer/Counter1 Compare Match A */

#define TIMER1_COMPB_vect_num 12
#define TIMER1_COMPB_vect _VECTOR(12)  /* Timer/Counter1 Compare Match B */ 

#define TIMER1_OVF_vect_num   13
#define TIMER1_OVF_vect   _VECTOR(13)  /* Timer/Counter1 Overflow */

#define TIMER0_COMPA_vect_num 14
#define TIMER0_COMPA_vect _VECTOR(14)  /* TimerCounter0 Compare Match A */

#define TIMER0_COMPB_vect_num 15
#define TIMER0_COMPB_vect _VECTOR(15)  /* TimerCounter0 Compare Match B */

#define TIMER0_OVF_vect_num  16
#define TIMER0_OVF_vect   _VECTOR(16)  /* Timer/Couner0 Overflow */

#define SPI_STC_vect_num  17
#define SPI_STC_vect      _VECTOR(17)  /* SPI Serial Transfer Complete */

#define USART_RX_vect_num 18
#define USART_RX_vect     _VECTOR(18)  /* USART Rx Complete */

#define USART_UDRE_vect_num   19
#define USART_UDRE_vect   _VECTOR(19)  /* USART, Data Register Empty */

#define USART_TX_vect_num 20
#define USART_TX_vect     _VECTOR(20)  /* USART Tx Complete */

#define ADC_vect_num      21
#define ADC_vect          _VECTOR(21)  /* ADC Conversion Complete */

#define EE_READY_vect_num 22
#define EE_READY_vect     _VECTOR(22)  /* EEPROM Ready */

#define ANALOG_COMP_vect_num  23
#define ANALOG_COMP_vect  _VECTOR(23)  /* Analog Comparator */

#define TWI_vect_num      24
#define TWI_vect          _VECTOR(24)  /* Two-wire Serial Interface */

#define SPM_READY_vect_num    25
#define SPM_READY_vect    _VECTOR(25)  /* Store Program Memory Read */

#define _VECTORS_SIZE (26 * 4)



/* Constants */
#define SPM_PAGESIZE 128
#define RAMSTART     (0x100)
#define RAMEND       0x8FF     /* Last On-Chip SRAM Location */
#define XRAMSIZE     0
#define XRAMEND      RAMEND
#define E2END        0x3FF
#define E2PAGESIZE   4
#define FLASHEND     0x7FFF



